Revit 2027 API
GroupTypeId.PrimaryUnits Property
 Primary Units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PrimaryUnits { get; }
Public Shared ReadOnly Property PrimaryUnits As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PrimaryUnits {
	ForgeTypeId^ get ();
}
static member PrimaryUnits : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace